#coding: utf-8
import config
import random
from requests_oauthlib import OAuth1Session
import requests
import datetime

oauth = OAuth1Session(
    config.Consumer_API_key, 
    config.Consumer_API_secret_key, 
    config.Access_Token, 
    config.Access_Token_secret
)
url = "https://api.twitter.com/1.1/statuses/update.json"
body_list = ["蕗の薹chang!!","(^q^)イヒwwwwwwww","ﾀﾞｧｼｴﾘｲｪｽ!!（ドアが閉まります）","ついったぁの男のひと全員にマシュマロあたっく～～₍₍ ( ๑॔˃̶◡ ˂̶๑॓)◞♡♡はい、調子乗ってマシュマロあたっくしてくるやろ お前ほんまに覚えとけよ ガチで仕返ししたるからな ほんまにキレタ 絶対許さん お前のID控えたからな♡♡( ु•⌄• )","╰U╯☜(｡◐ω◐｡)ちんちん.","(☝ ՞ਊ ՞）☝(☝ ՞ਊ ՞）☝＜あ”あ”あ”あ”あ”あ”あ”あ”あ”あ”あ”あ”あ”ぁ”ぁ”ぁ”ぁ”ぁ”ぁ”ぁ”ぁ”ぁ”ぁ”ぁ”ぁ”ぁ”ぁ”","傲慢( ◠‿◠ )　ふぁぼれよ\n嫉妬(╬◠‿◠ )　俺もふぁぼれよ\n憤怒(╬◠‿◠╬)　さっさとふぁぼれよ\n怠惰_ ◠‿◠ )_　RTでもいいぞ\n強欲☜( ◠‿◠ )☞　全部ふぁぼれよ\n暴食( ◠☆◠ )　おいしいぞ\n色欲(*◔ڼ◔)　ふぁぼっ","(՞ةڼ◔)わぁぁぁぁぁぁぁぁぁぁぁぁあぁぁぁぁぁぁぁぁぁぁあぁぁぁぁぁぁ！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！","+\n　　　 ∧∧　 ∧∞∧　*\n*　 ヽ(՞ةڼ◔)人(՞ةڼ◔)ﾉ\n　.～（ O x.） （ 　 O)～　+\n。*　 　∪　　　　∪　\n＿人人人人人人人人人＿\n＞ 2人はマジキチ ＜\n￣Y^Y^Y^Y^Y^Y^Y^Y^Y^￣","(╮╯╭)＜キャベツです。本当なんです。信じてください。決して玉ねぎなんかじゃないｼﾞｬｶﾞ。ほんとｼﾞｬｶﾞ。信じてほしいｼﾞｬｶﾞ！！","むすんでー　(乂’ω’)\nひらいてー　ヽ(’ω’)ﾉ\n手をうってー　(’ω’ ﾉﾉ”) ﾊﾟﾝｯ\nむーすんでー　(’ω’乂)\nまたひらいて　ヽ(’ω’)ﾉ\n手をうって　(’ω’ﾉﾉ”)ﾊﾟﾝｯﾊﾟﾝｯ\nその手を…　(’ω’ )\nう、う…＼( 'ω')／ｳｵｵｵｵｱｱｱｱｱｯ!!!","(✌('ω')✄ ╰⋃╯ㄘんㄘん","ʕ ·ᴥ·ʔ✂╰⋃╯ㄘんㄘん切るお！","*･ﾟﾟ･*:.｡..｡.:*ﾟ:*:✼✿(ღ✪ｖ✪)｡ﾟ:*:✼✿ｷﾗｷﾗ一女だょ〜。♥","(^q^)蕗の薹ちゃん！！！！","(・_・)。o(ｲｴｴｴｴｴｴｴｴwwwwww\n(・_・)。o(ｷｼｱｱｱｼｭｳｳｳwwwwww\n(・_・)。o(ﾄﾞｺﾄﾞｺﾄﾞｺwwwwww\n＿人人人人人＿\n＞ 無表情 ＜\n￣ Y^Y^Y^Y^￣","( ☉‿☉ )ｶｯ( ☉‿☉ )ｶｯﾄﾞ━━━━m9(ﾟ∀ﾟ)━━━━ﾝ!!( ☉‿☉ )ｶｯ└(┐┘◠‿◠)┐ﾄﾞｺﾄﾞｺﾄﾞｺﾄﾞｺ","┏━━━━━━┓┏━━┓\n┃┏┓┏┓┏┓┣┫ 精 ┃\n┃┗┛┗┛┗┛┣┫ 神 ┃\n┃┏┓┏┓┏┓┃┃ 科 ┃\n┃┗┛┗┛┗┛┃┗━━┛\n┃┏━━━━┓┃\n┃┃┌┛’,;’;≡三\n┃┃　　 ┌┛’,;’;≡三( ՞ةڼ◔)","ドドドドドドドドド\n　( ﾉᾥ’ )\n　 ＼ ﾉ＼\　　＼　＼\n　　／￣￣＼\nお客様...バァーン！",". ■■■■■■■　\n　■■■ｔ■■■\n　　■■■ｗ■■■\n　　■■■ｉ■■■\n　　■■■ｔ■■■\n　　■■■ｔ■■■\n　　■■■ｅ■■■\n▼▼▼▼▼ｒ▼▼▼▼▼ 　\n　▼▼▼▼廃▼▼▼▼\n　　▼▼▼人▼▼▼\n　　　▼▼▼▼▼\n　　　　▼▼▼\n　　　　　▼","　　.∵☎\n　　　ﾟ∴\n(ﾉ՞ةڼ◔)ﾉ","①はっきりと意思表示\n( ◠‿◠)＜ボッチめ (’ω’乂)＜NO\n \n②「理由」を話す\n( ◠‿◠) ☝(’ω’ )＜おはようって言ってくれる\n \n③現実\n( ◠‿◠)＜それはbotだ(’ω’ )...\n ④ \n(’ω’)＜ウワアアアアアアアアアアアアア","米青 ネ申 禾斗 ιこ 彳〒 ιナ","クリアアサヒが♪L( ＾ω＾ )┘└( ＾ω＾ )」♪\n \n今日もない ♪L( ＾ω＾ )┘└( ＾ω＾ )」♪\n \n＿人人人人＿\n＞　ない　＜\n￣Y^Y^Y^Y￣","ツイッターの┗(^o^ )┓三ｗｗｗｗタイムラインは三┏( ^o^)┛ｗｗｗｗキチガイツイート（´◔‿ゝ◔｀☝☝三☝☝´◔‿ゝ◔｀）ｗｗｗいっぱいいっぱい✌✌(‘ω’)✌✌ｗｗｗｗｗｗｗｗｗｗﾎﾟﾊﾟﾔ---┗┏┗┏('o')┓┛┓┛ﾎﾟﾊﾟﾔｗｗｗｗｗｗﾎﾟﾊﾟﾔ---wwww"]
max_index = len(body_list) - 1
body_index =random.randint(0, max_index)
body = body_list[body_index] 

timestamp = datetime.datetime.today() + datetime.timedelta(hours=9)
timestamp = str(timestamp.strftime("%Y/%m/%d %H:%M"))

params = {"status" : body}
response = oauth.post(url, params = params)
if response.status_code == 200 :
    print("success")
else :
    print(f"Error{response.status_code}")